In [14]:
# 문 titanic 데이터 셋을 불러와서
# 1. 나이가 10세 미만인 승객의 class, 성별, 나이, 생존여부를 출력
# 2. 클래스가 1등급인 승객의 나이, fare, 클래스, 생존 여부를 출력
# 3. 성별이 남성이고 20대에서 40대 미만인 승객의 모든 정보 출력

import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

print(df.head())

df_age = df.loc[df.age < 10, ['class', 'age', 'sex', 'alive']]
print(df_age)

df_class = df.loc[df['class'] == 'First', ['age', 'fare', 'class', 'alive']]
print(df_class)

df_man = df[(df['sex'] == 'male') & (df['age'] >= 20) & (df['age'] < 40)]
df_man

#sns.countplot(data=df, x="Embarked", hue="Survived")

#low_fare = train[train[""] < 500]

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
      class   age     sex alive
7     Third  2.00    male    no
10    Third  4.00  female   yes
16    Third  2.00    male    no
24    Third  8.00  female    no
43   Second  3.00  female   yes
..      ...   ...     ...   ...
827  Second  1.00    male   yes
831  Second  0.83    male   yes
850   Third  4.00    male    no
852   Third  9.00  female    no
869   Third  4.00    male   yes

[62 rows x 4 columns]
      age     fare  class alive
1    38.0  71.2833  First   yes
3    35.0  53.1000  First   yes
6    54.0  51.8625  First    no
11   58.0  26.5500  First   yes
23   28.0  35.5000  First   yes
..    ...      ...    ...   ...
871  47.0  52.5542  First   yes
872  33.0   5.0000  First    no
879  56.0  83.1583  First   yes
887  19.0  30.0000  First   yes
889  26.0  30.0000  First   yes

[216 rows x 4 columns]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.250,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.050,S,Third,man,True,NaN,Southampton,no,True
12,0,3,male,20.0,0,0,8.050,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.275,S,Third,man,True,NaN,Southampton,no,False
20,0,2,male,35.0,0,0,26.000,S,Second,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.500,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.050,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.750,Q,Third,man,True,NaN,Queenstown,no,True